修正概要: 図版をMermaid形式に変更
